---
kind: property
id: P:Autodesk.Revit.DB.WallType.Width
zh: 宽度
source: html/4333bb52-36aa-3514-e6cc-3bc53f6134e5.htm
---
# Autodesk.Revit.DB.WallType.Width Property

**中文**: 宽度

The overall thickness of this type of wall.

## Syntax (C#)
```csharp
public double Width { get; }
```